app/controllers/books_controller.rb

  def create
  	    book = Book.new(book_params)
  	    book.user_id = current_user.id
        book.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "アルゴリズム図鑑"], ["body", "っっp"], ["created_at", "2019-01-23 05:49:38.048244"], ["updated_at", "2019-01-23 05:49:38.048244"], ["user_id", "4"]]

  def update
  	book = Book.find(params[:id])
    book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "hhwww"], ["updated_at", "2019-01-24 10:02:17.248156"], ["id", 24]]