app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:a] = "successfully"
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
SELECT "books".* FROM "books"