app/controllers/users_controller.rb

  def update
    @user =User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "mo"], ["image_id", "0598a073b47cfc084e2758417a0139ea0878f3b6da7eddafa2e4b079caeb"], ["updated_at", "2019-01-26 06:02:09.166413"], ["id", 10]]